{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 256,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 257,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 258,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": "</w>",
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "'": 1,
      ".": 2,
      "0": 3,
      "1": 4,
      "2": 5,
      "A": 6,
      "B": 7,
      "C": 8,
      "D": 9,
      "E": 10,
      "F": 11,
      "G": 12,
      "H": 13,
      "I": 14,
      "J": 15,
      "K": 16,
      "L": 17,
      "M": 18,
      "N": 19,
      "O": 20,
      "P": 21,
      "Q": 22,
      "R": 23,
      "S": 24,
      "T": 25,
      "U": 26,
      "V": 27,
      "W": 28,
      "X": 29,
      "Y": 30,
      "Z": 31,
      "Ġ": 32,
      "S</w>": 33,
      "K</w>": 34,
      "N</w>": 35,
      "0</w>": 36,
      "O</w>": 37,
      "A</w>": 38,
      "Y</w>": 39,
      "G</w>": 40,
      "E</w>": 41,
      "Z</w>": 42,
      "P</w>": 43,
      "L</w>": 44,
      "T</w>": 45,
      "D</w>": 46,
      "R</w>": 47,
      "H</w>": 48,
      "M</w>": 49,
      "C</w>": 50,
      "V</w>": 51,
      "2</w>": 52,
      "1</w>": 53,
      "F</w>": 54,
      "I</w>": 55,
      "W</w>": 56,
      "B</w>": 57,
      "U</w>": 58,
      "X</w>": 59,
      "J</w>": 60,
      "Q</w>": 61,
      "'</w>": 62,
      ".</w>": 63,
      "ĠA": 64,
      "1Ġ": 65,
      "0Ġ": 66,
      "H0Ġ": 67,
      "ĠI": 68,
      "ĠE": 69,
      "ĠAH0Ġ": 70,
      "H1Ġ": 71,
      "ĠIY": 72,
      "NĠ": 73,
      "ĠIH0Ġ": 74,
      "2Ġ": 75,
      "ĠER": 76,
      "ĠAA": 77,
      "SĠ": 78,
      "OW": 79,
      "ĠAE": 80,
      "ĠEH1Ġ": 81,
      "ĠR": 82,
      "IN": 83,
      "Y1Ġ": 84,
      "ER": 85,
      "ĠAA1Ġ": 86,
      "ĠAE1Ġ": 87,
      "ĠIH1Ġ": 88,
      "LĠ": 89,
      "KĠ": 90,
      "RĠ": 91,
      "ĠER0Ġ": 92,
      "ĠIY0</w>": 93,
      "AN": 94,
      "SH": 95,
      "ĠAO": 96,
      "CH": 97,
      "AR": 98,
      "UW": 99,
      "TĠ": 100,
      "EN": 101,
      "HH": 102,
      "ĠIY1Ġ": 103,
      "H2Ġ": 104,
      "ĠEY1Ġ": 105,
      "ĠAH0ĠNĠ": 106,
      "ĠAH0ĠN</w>": 107,
      "AT": 108,
      "GĠ": 109,
      "ST": 110,
      "OW1Ġ": 111,
      "OR": 112,
      "ON": 113,
      "ĠAO1Ġ": 114,
      "LE": 115,
      "ĠAH": 116,
      "ĠAH0</w>": 117,
      "RE": 118,
      "ĠIY0Ġ": 119,
      "MĠ": 120,
      "ĠER0</w>": 121,
      "AL": 122,
      "ĠAH1Ġ": 123,
      "SĠT": 124,
      "ER</w>": 125,
      "UW1Ġ": 126,
      "ĠIH0ĠN": 127,
      "EL": 128,
      "DĠ": 129,
      "TH": 130,
      "JH": 131,
      "Y2Ġ": 132,
      "ĠAY1Ġ": 133,
      "ES</w>": 134,
      "ED</w>": 135,
      "ING</w>": 136,
      "PĠ": 137,
      "RI": 138,
      "RO": 139,
      "IL": 140,
      "ON</w>": 141,
      "UN": 142,
      "RA": 143,
      "IT": 144,
      "BĠ": 145,
      "ĠAA0Ġ": 146,
      "ĠIH0ĠNG</w>": 147,
      "ĠAH0ĠL</w>": 148,
      "ĠER1Ġ": 149,
      "IS": 150,
      "OL": 151,
      "MA": 152,
      "IH0Ġ": 153,
      "TĠS</w>": 154,
      "OW0</w>": 155,
      "OW0Ġ": 156,
      "ĠAH0ĠL": 157,
      "IC": 158,
      "OU": 159,
      "ĠIY0": 160,
      "ES": 161,
      "ĠAA1ĠRĠ": 162,
      "ĠER0ĠZ</w>": 163,
      "AH0Ġ": 164,
      "LA": 165,
      "NĠAH0Ġ": 166,
      "ET": 167,
      "LĠIY0</w>": 168,
      "AE": 169,
      "LĠAH0Ġ": 170,
      "FĠ": 171,
      "ĠAW": 172,
      "NĠD": 173,
      "NGĠ": 174,
      "ĠAH0ĠNĠZ</w>": 175,
      "ĠEH2Ġ": 176,
      "ĠAO1ĠRĠ": 177,
      "NĠT": 178,
      "UR": 179,
      "YĠ": 180,
      "ĠAA2Ġ": 181,
      "CO": 182,
      "ĠAY2Ġ": 183,
      "ĠAH0ĠLĠ": 184,
      "PĠR": 185,
      "LI": 186,
      "DE": 187,
      "ĠAE2Ġ": 188,
      "SĠK": 189,
      "TI": 190,
      "TĠR": 191,
      "BĠR": 192,
      "EH1Ġ": 193,
      "AM": 194,
      "DĠIH0Ġ": 195,
      "ĠEY2Ġ": 196,
      "ĠIY0ĠZ</w>": 197,
      "TĠIH0Ġ": 198,
      "ĠIH2Ġ": 199,
      "ERS</w>": 200,
      "ĠAH0ĠN": 201,
      "AS": 202,
      "GĠR": 203,
      "ING": 204,
      "IN</w>": 205,
      "AB": 206,
      "UL": 207,
      "SĠIH0Ġ": 208,
      "KĠR": 209,
      "LY</w>": 210,
      "LE</w>": 211,
      "AA": 212,
      "ĠEH0Ġ": 213,
      "LO": 214,
      "AC": 215,
      "AD": 216,
      "ĠAY": 217,
      "AE1Ġ": 218,
      "ĠAW1Ġ": 219,
      "SI": 220,
      "ZĠ": 221,
      "LĠIH0Ġ": 222,
      "NĠZ</w>": 223,
      "ĠEH1ĠR": 224,
      "SE": 225,
      "AN</w>": 226,
      "MĠAH0Ġ": 227,
      "SĠAH0Ġ": 228,
      "SĠT</w>": 229,
      "DI": 230,
      "ATI": 231,
      "KĠAH0Ġ": 232,
      "LĠAE1Ġ": 233,
      "KĠS</w>": 234,
      "ĠEY": 235,
      "QU": 236,
      "UH1Ġ": 237,
      "RU": 238,
      "ĠOW1Ġ": 239,
      "AG": 240,
      "DĠZ</w>": 241,
      "OW2Ġ": 242,
      "IR": 243,
      "ĠAO2Ġ": 244,
      "UW0Ġ": 245,
      "KĠAA1Ġ": 246,
      "NĠIH0Ġ": 247,
      "TĠAH0Ġ": 248,
      "SĠP": 249,
      "AU": 250,
      "KĠW": 251,
      "OO": 252,
      "EN</w>": 253,
      "CK": 254,
      "CON": 255
    },
    "merges": [
      "Ġ A",
      "1 Ġ",
      "0 Ġ",
      "H 0Ġ",
      "Ġ I",
      "Ġ E",
      "ĠA H0Ġ",
      "H 1Ġ",
      "ĠI Y",
      "N Ġ",
      "ĠI H0Ġ",
      "2 Ġ",
      "ĠE R",
      "ĠA A",
      "S Ġ",
      "O W",
      "ĠA E",
      "ĠE H1Ġ",
      "Ġ R",
      "I N",
      "Y 1Ġ",
      "E R",
      "ĠAA 1Ġ",
      "ĠAE 1Ġ",
      "ĠI H1Ġ",
      "L Ġ",
      "K Ġ",
      "R Ġ",
      "ĠER 0Ġ",
      "ĠIY 0</w>",
      "A N",
      "S H",
      "ĠA O",
      "C H",
      "A R",
      "U W",
      "T Ġ",
      "E N",
      "H H",
      "ĠIY 1Ġ",
      "H 2Ġ",
      "ĠE Y1Ġ",
      "ĠAH0Ġ NĠ",
      "ĠAH0Ġ N</w>",
      "A T",
      "G Ġ",
      "S T",
      "OW 1Ġ",
      "O R",
      "O N",
      "ĠAO 1Ġ",
      "L E",
      "ĠA H",
      "ĠAH 0</w>",
      "R E",
      "ĠIY 0Ġ",
      "M Ġ",
      "ĠER 0</w>",
      "A L",
      "ĠA H1Ġ",
      "SĠ T",
      "E R</w>",
      "UW 1Ġ",
      "ĠIH0Ġ N",
      "E L",
      "D Ġ",
      "T H",
      "J H",
      "Y 2Ġ",
      "ĠA Y1Ġ",
      "E S</w>",
      "E D</w>",
      "IN G</w>",
      "P Ġ",
      "R I",
      "R O",
      "I L",
      "O N</w>",
      "U N",
      "R A",
      "I T",
      "B Ġ",
      "ĠAA 0Ġ",
      "ĠIH0ĠN G</w>",
      "ĠAH0Ġ L</w>",
      "ĠER 1Ġ",
      "I S",
      "O L",
      "M A",
      "I H0Ġ",
      "TĠ S</w>",
      "OW 0</w>",
      "OW 0Ġ",
      "ĠAH0Ġ L",
      "I C",
      "O U",
      "ĠIY 0",
      "E S",
      "ĠAA1Ġ RĠ",
      "ĠER0Ġ Z</w>",
      "A H0Ġ",
      "L A",
      "N ĠAH0Ġ",
      "E T",
      "L ĠIY0</w>",
      "A E",
      "L ĠAH0Ġ",
      "F Ġ",
      "ĠA W",
      "NĠ D",
      "N GĠ",
      "ĠAH0ĠNĠ Z</w>",
      "ĠE H2Ġ",
      "ĠAO1Ġ RĠ",
      "NĠ T",
      "U R",
      "Y Ġ",
      "ĠAA 2Ġ",
      "C O",
      "ĠA Y2Ġ",
      "ĠAH0Ġ LĠ",
      "P ĠR",
      "L I",
      "D E",
      "ĠAE 2Ġ",
      "SĠ K",
      "T I",
      "T ĠR",
      "B ĠR",
      "E H1Ġ",
      "A M",
      "D ĠIH0Ġ",
      "ĠE Y2Ġ",
      "ĠIY0Ġ Z</w>",
      "T ĠIH0Ġ",
      "ĠI H2Ġ",
      "ER S</w>",
      "ĠAH0Ġ N",
      "A S",
      "G ĠR",
      "IN G",
      "I N</w>",
      "A B",
      "U L",
      "S ĠIH0Ġ",
      "K ĠR",
      "L Y</w>",
      "L E</w>",
      "A A",
      "ĠE H0Ġ",
      "L O",
      "A C",
      "A D",
      "ĠA Y",
      "AE 1Ġ",
      "ĠAW 1Ġ",
      "S I",
      "Z Ġ",
      "L ĠIH0Ġ",
      "NĠ Z</w>",
      "ĠEH1Ġ R",
      "S E",
      "A N</w>",
      "M ĠAH0Ġ",
      "S ĠAH0Ġ",
      "SĠ T</w>",
      "D I",
      "AT I",
      "K ĠAH0Ġ",
      "L ĠAE1Ġ",
      "KĠ S</w>",
      "ĠE Y",
      "Q U",
      "U H1Ġ",
      "R U",
      "Ġ OW1Ġ",
      "A G",
      "DĠ Z</w>",
      "OW 2Ġ",
      "I R",
      "ĠAO 2Ġ",
      "UW 0Ġ",
      "K ĠAA1Ġ",
      "N ĠIH0Ġ",
      "T ĠAH0Ġ",
      "SĠ P",
      "A U",
      "KĠ W",
      "O O",
      "E N</w>",
      "C K",
      "C ON"
    ]
  }
}